{ config, pkgs, var, ... }:
{
  # ===========================================================================
  # Shared Home Manager Modules / 共有Home Managerモジュール
  # ===========================================================================
  # ここに追加したモジュールは、Home Managerの設定（home.nix）から自動的に読み込まれます。
  # ===========================================================================

  imports = [
    # --- デスクトップ環境 (Desktop Environments) ---
    ./DE/gnome/gnome.nix
    ./DE/kde/kde.nix
    ./DE/niri/niri.nix
  ];
}
